LEVEL_LANG = "<b>Уровень начинающего (A1 - Beginner)</b>: На этом уровне учащиеся могут понимать и использовать основные фразы и выражения, связанные с себя представлением, семьей, покупками, местом жительства и повседневными ситуациями. Они способны общаться на простых и повседневных темах с помощью коротких и простых предложений.\n\n" \
             "<b>Уровень Elementary (A2 - Elementary)</b>: На уровне Elementary учащиеся могут участвовать в простых беседах на темы, знакомые им из повседневной жизни. Они умеют описывать свои интересы, опыт и окружающую среду. " \
             "Также они способны понимать краткие объяснения и инструкции на простых темах.\n\n" \
             "<b>Уровень Pre-Intermediate (B1 - Pre-Intermediate)</b>: На этом уровне учащиеся могут участвовать в более сложных беседах и общении на разнообразные темы. Они могут описывать события, мнения и планы, а также задавать вопросы и выражать свои мысли с использованием более разнообразных структур языка.\n\n" \
             "<b>Уровень Intermediate (B2 - Intermediate)</b>: На уровне Intermediate учащиеся уже способны проводить продолжительные беседы на различные темы. Они могут понимать и анализировать сложные тексты, а также выражать свои мысли более точно и выразительно. На этом уровне учащиеся также могут начать использовать английский язык для работы или учебы."
t1 =    "Глагол <b>to be</b> (быть) - это особенный глагол в английском языке, который помогает нам описывать разные вещи. Он говорит о том, что мы чувствуем, где находимся, и что мы делаем.\n\n" \
        "Например, когда мы говорим <b>I am happy</b> (я счастлив), мы выражаем свое состояние. Когда говорим <b>She is tired</b> (она устала), описываем состояние другого человека.\n\n" \
        "Мы также можем использовать глагол <b>to be</b> для того, чтобы представить что-то или сказать, где что-то находится. Например, <b>This is my cat</b> (это мой кот), показывает, что кот принадлежит нам.\n\n" \
        "Иногда глагол <b>to be</b> помогает нам рассказать о времени или дне недели. Например, <b>It is 3 o'clock</b> (сейчас 3 часа) или <b>Today is Monday</b> (сегодня понедельник).\n\n" \
        "Когда мы описываем что-то, например фильм или погоду, мы также используем глагол <b>to be</b>. Например, <b>The movie was interesting</b> (фильм был интересным) или <b>The weather is sunny</b> (погода солнечная).\n\n" \
        "Чтобы стать лучше в использовании этого глагола, просто практикуйтесь и используйте его в различных ситуациях. Это поможет вам стать более уверенным в английском языке и выразить свои мысли легко и точно. Удачи в изучении!"
t2 =    "Правило a/an, the относится к использованию артиклей в английском языке. Артикли - это слова, которые предшествуют существительным и помогают определить, относится ли существительное к определенному или неопределенному объекту или предмету.\n\n" \
        "a и an - это неопределенные артикли, которые используются перед единственными существительными, чтобы указать на неопределенный или неизвестный объект или предмет.\n\n" \
        "Примеры:\n\n" \
        "1)I saw a tiger in the jungle. (Я видел тигра в джунглях.)\n" \
        "2)She found an interesting book. (Она нашла интересную книгу.)\n" \
        "3)He has a dog. (У него есть собака).\n\n" \
        "the - это определенный артикль, который используется перед существительными, чтобы указать на конкретный, определенный объект или предмет, который уже упоминался или хорошо известен собеседнику.\n\n" \
        "Пример:\n\n" \
        "1)The tiger in the jungle looked hungry. (Тигр в джунглях выглядел голодным.)\n" \
        "2)They followed the map to find the treasure. (Они следовали картам, чтобы найти сокровища.)\n" \
        "3)The sun rises in the east. (Солнце восходит на востоке.)"
t3 =    "<b>There is</b> используется с единственным существительным или с неопределенным количеством существительных (как правило, в единственном числе).\n" \
        "Например: There is a cat in the garden (В саду есть кошка).\n\n" \
        "<b>There are</b> используется с исчисляемыми существительными во множественном числе.\n" \
        "Например: There are flowers in the vase (В вазе есть цветы)."
t4 =    "<b>How</b> - это вопросительное наречие, которое используется для запроса информации о способе выполнения действия, состоянии, количестве или характеристиках чего-либо. <b>How much</b> используется с неисчисляемыми существительными для запроса о количестве, а <b>how many</b> - с исчисляемыми существительными для запроса о количестве во множественном числе. Вот объяснение и примеры в положительной форме, отрицательной форме и форме вопроса:\n\n" \
        "How: используется для задания вопросов о способе, образе выполнения действия или о характеристиках.\n" \
        "How much: используется с неисчисляемыми существительными для запроса о количестве.\n" \
        "How many: используется с исчисляемыми существительными во множественном числе для запроса о количестве.\n\n" \
        "Примеры:\n\n" \
        "How are you today? (Как ты сегодня?)\n" \
        "How much money do you have? (Сколько у тебя денег?)\n" \
        "How many books are on the shelf? (Сколько книг на полке?)\n\n" \
        "Вопросительные наречия <b>how</b>, <b>how much</b> и <b>how many</b> позволяют нам задавать различные вопросы о разных аспектах, таких как способ, количество или характеристики, делая нашу речь более информативной и выразительной."
t5 =    "Правило <i>Существительные в единственном и множественном числе (-s, -es)</i> используется для указания того, находится ли существительное в форме единственного числа (относится к одному элементу) или во множественном числе (относится к более чем одному элементу). Добавляя «-s» или «-es» к определенным существительным, мы можем различать формы единственного и множественного числа в английских предложениях. Это правило является основополагающим для понимания количества и количества объектов или объектов, о которых идет речь в предложении\n\n" \
        "1.Positive form (утвердительная форма):\n\n" \
        "1)Единственное число:\n" \
        "The cat is sleeping. (Кошка спит.)\n" \
        "A book is on the table. (Книга на столе.)\n" \
        "2)Множественное число:\n" \
        "The cats are sleeping. (Кошки спят.)\n" \
        "Books are on the table. (Книги на столе.)\n\n" \
        "2.Negative form (отрицательная форма):\n\n" \
        "1)Единственное число:\n" \
        "The cat is not sleeping. (Кошка не спит.)\n" \
        "There is not a book on the table. (На столе нет книги.)\n" \
        "2)Множественное число:\n" \
        "The cats are not sleeping. (Кошки не спят.)\n" \
        "There are not books on the table. (На столе нет книг.)\n\n" \
        "3.Question form (вопросительная форма):\n\n" \
        "1)Единственное число:\n" \
        "Is the cat sleeping? (Кошка спит?)\n" \
        "Is there a book on the table? (На столе есть книга?)\n" \
        "2)Множественное число:\n" \
        "Are the cats sleeping? (Кошки спят?)\n" \
        "Are there books on the table? (На столе есть книги?)\n"
t6 =    "Правило <i>модальный глагол can/can't</i> используется для выражения возможности, способности или разрешения на английском языке. Давайте рассмотрим данное правило в различных формах:\n\n" \
        "1)Positive form (утвердительная форма):\n\n" \
        "I can swim. (Я умею плавать.)\n" \
        "She can play the piano. (Она умеет играть на пианино.)\n" \
        "2)Negative form (отрицательная форма):\n\n" \
        "I can't swim. (Я не умею плавать.)\n" \
        "She can't play the piano. (Она не умеет играть на пианино.)\n\n" \
        "3)Question form (вопросительная форма):\n\n" \
        "Can you swim? (Ты умеешь плавать?)\n" \
        "Can she play the piano? (Она умеет играть на пианино?)\n" \
        "Обратите внимание, что модальный глагол <i>can</i> не изменяется по лицам (I, you, he/she/it, we, they) и всегда используется без изменений. В утвердительной форме <i>can</i> ставится перед смысловым глаголом без частицы <i>to</i>, в отрицательной форме добавляется частица <i>not</i> и вопросительная форма образуется путем перестановки <i>can</i> и подлежащего.\n" \
        "Этот модальный глагол используется для обозначения наличия возможности или способности что-либо делать, а также для выражения разрешения или согласия. Это одно из наиболее употребляемых модальных глаголов в английском языке."
t7 =    "Правило <i>Личные местоимения I, we, you, they, he, she, it</i> относится к основным местоимениям в английском языке, которые заменяют имена существительные и используются для обозначения людей, животных или предметов, о которых идет речь. Давайте рассмотрим это правило и примеры в положительной форме, отрицательной форме и вопросительной форме:\n\n" \
        "1)Positive form (утвердительная форма):\n\n" \
        "I like to read books. (Я люблю читать книги.)\n" \
        "You play the guitar very well. (Ты играешь на гитаре очень хорошо.)\n" \
        "They enjoy traveling. (Они любят путешествовать.)\n\n" \
        "2)Negative form (отрицательная форма):\n\n" \
        "I do not like to read books. (Я не люблю читать книги.)\n" \
        "You do not play the guitar very well. (Ты не играешь на гитаре очень хорошо.)\n" \
        "They do not enjoy traveling. (Они не любят путешествовать.)\n\n" \
        "3)Question form (вопросительная форма):\n\n" \
        "Do I like to read books? (Я люблю читать книги?)\n" \
        "Do you play the guitar very well? (Ты играешь на гитаре очень хорошо?)\n" \
        "Do they enjoy traveling? (Они любят путешествовать?)\n\n" \
        "Личные местоимения играют важную роль в английском языке и используются для указания на человека (или другое существо) или вещь, о которых идет речь. Они помогают установить подлежащее в предложении и понять, о ком или о чем идет речь в различных контекстах."
t8 =    "Правило <i>неопределенные местоимения some/any</i> используется для обозначения неопределенного количества или количества, неизвестного в данный момент времени. Эти местоимения указывают на наличие или отсутствие чего-либо в вопросительных и отрицательных предложениях на английском языке.\n" \
        "<i>Some</i> используется в утвердительных предложениях для обозначения неопределенного количества или предложения предложить что-то положительное, а <i>any</i> используется в вопросительных и отрицательных предложениях для обозначения отсутствия или запроса неопределенного количества.\n\n" \
        "Эти неопределенные местоимения используются для выражения различных ситуаций в разговорной и письменной речи на английском языке, особенно при обсуждении предметов, еды или предложений о чем-либо."
t9 =    "Правило <i>Указательные местоимения this/that/these/those</i> используется для указания на определенные предметы, людей или места в предложении на английском языке.\n" \
        "Давайте рассмотрим это правило:\n" \
        "This is my book. (Это моя книга.)\n" \
        "That is a beautiful flower. (То красивый цветок.)\n" \
        "These are my friends. (Это мои друзья.)\n" \
        "Those are his toys. (Те его игрушки.)\n\n" \
        "<i>This</i> используется в единственном числе для обозначения предмета или лица, находящегося рядом с говорящим, а <i>that</i> используется в единственном числе для обозначения предмета или лица, находящегося вдали от говорящего. <i>these</i> используется во множественном числе для обозначения предметов или лиц, находящихся рядом с говорящим, а <i>those</i> используется во множественном числе для обозначения предметов или лиц, находящихся вдали от говорящего.\n\n" \
        "Указательные местоимения помогают установить местоположение или определить, о каких предметах или лицах идет речь в различных ситуациях или контекстах."
t10 =   "Правило <i>Притяжательные местоимения my, our, your, his, her, its</i> используется для обозначения принадлежности или притяжения к кому-то или чему-то на английском языке. Давайте рассмотрим это правило:\n" \
        "1)This is my book. (Это моя книга.)\n" \
        "2)Our house is big. (Наш дом большой.)\n" \
        "3)Is this your pen? (Это твоя ручка?)\n" \
        "4)His car is red. (Его машина красная.)\n" \
        "5)Her cat is playful. (Её кошка игривая.)\n" \
        "6)Its color is blue. (Его цвет синий.)\n" \
        "Притяжательные местоимения указывают на принадлежность или связь с определенным лицом или вещью. <i>my</i> используется для обозначения принадлежности к говорящему, <i>our</i> - к говорящему и его группе (например, семье), <i>your</i> - к адресату (тому, кому говорят), <i>his</i> - к мужскому лицу или вещи, <i>her</i> - к женскому лицу или вещи, <i>its</i> - к неодушевленным объектам, животным или детским вещам.\n\n" \
        "Притяжательные местоимения помогают уточнить владение или принадлежность к кому-то или чему-то в предложениях на английском языке."
t11 =   "Правило <i>Наречия частности always, often, never</i> используется для указания на частоту или регулярность действий, событий или состояний в английском языке. Давайте рассмотрим это правило:\n\n" \
        "1)She always arrives on time. (Она всегда приходит вовремя.)\n" \
        "2)I often go to the gym. (Я часто хожу в спортзал.)\n" \
        "3)He never forgets his keys. (Он никогда не забывает свои ключи.)\n\n" \
        "Наречия частности используются для обозначения степени частоты или регулярности действий или событий. <i>always</i> означает <i>всегда</i> и указывает на повторение действия или события без исключения, <i>often</i> означает <i>часто</i> и указывает на повторение действия или события в большинстве случаев, <i>never</i> означает <i>никогда</i> и указывает на отсутствие действия или события.\n\n" \
        "Наречия частности помогают сделать высказывания более точными и выразительными, обозначая частоту или отсутствие действий или событий в повседневной речи на английском языке."
t12 =   "Правило <i>Present Simple</i> (настоящее простое время) в английском языке используется для описания повседневных фактов, регулярных действий, привычек и общих истин. Оно также используется для выражения расписания, расположения и чувств. Всегда имеет одну и ту же форму для всех лиц (I, you, he/she/it, we, they) без добавления окончания.\n\n" \
        "Давайте рассмотрим это правило в различных формах:\n\n" \
        "1.Positive form (утвердительная форма):\n" \
        "I work at a company. (Я работаю в компании.)\n" \
        "She plays the piano. (Она играет на пианино.)\n" \
        "We live in a big house. (Мы живем в большом доме.)\n" \
        "They speak English. (Они говорят по-английски.)\n\n" \
        "2.Negative form (отрицательная форма):\n\n" \
        "I do not work at a company. (Я не работаю в компании.)\n" \
        "She does not play the piano. (Она не играет на пианино.)\n" \
        "We do not live in a big house. (Мы не живем в большом доме.)\n" \
        "They do not speak English. (Они не говорят по-английски.)\n\n" \
        "3.Question form (вопросительная форма):\n\n" \
        "Do I work at a company? (Я работаю в компании?)\n" \
        "Does she play the piano? (Она играет на пианино?)\n" \
        "Do we live in a big house? (Мы живем в большом доме?)\n" \
        "Do they speak English? (Они говорят по-английски?)\n\n" \
        "<i>Present Simple</i> используется для описания событий или действий, которые происходят регулярно, постоянно или не зависят от времени, в которое они происходят. Это одно из основных времен в английском языке, и его правильное использование позволяет четко выражать привычные действия и события."
t13 =   "Правило <i>Past Simple</i> (простое прошедшее время) в английском языке используется для описания завершенных действий или событий, которые произошли в прошлом и не имеют связи с настоящим временем. Обычно, в Past Simple добавляется окончание <b>-ed</b> к основной форме глагола для образования прошедшего времени. Однако, есть и неправильные глаголы, у которых формы в Past Simple образуются иначе.\n\n" \
        "Давайте рассмотрим это правило в различных формах:\n\n" \
        "Positive form (утвердительная форма):\n\n" \
        "I visited my grandparents yesterday. (Я посетил своих бабушку и дедушку вчера.)\n" \
        "She watched a movie last night. (Она посмотрела фильм вчера вечером.)\n" \
        "We played football on Saturday. (Мы играли в футбол в субботу.)\n" \
        "They ate dinner at a restaurant. (Они поужинали в ресторане.)\n\n" \
        "Negative form (отрицательная форма):\n\n" \
        "I did not visit my grandparents yesterday. (Я не посетил своих бабушку и дедушку вчера.)\n" \
        "She did not watch a movie last night. (Она не посмотрела фильм вчера вечером.)\n" \
        "We did not play football on Saturday. (Мы не играли в футбол в субботу.)\n" \
        "They did not eat dinner at a restaurant. (Они не поужинали в ресторане.)\n\n" \
        "Question form (вопросительная форма):\n\n" \
        "Did you visit your grandparents yesterday? (Ты посетил своих бабушку и дедушку вчера?)\n" \
        "Did she watch a movie last night? (Она посмотрела фильм вчера вечером?)\n" \
        "Did we play football on Saturday? (Мы играли в футбол в субботу?)\n" \
        "Did they eat dinner at a restaurant? (Они поужинали в ресторане?)\n\n" \
        "<i>Past Simple</i> используется для рассказов о прошлых событиях, которые уже завершились и не имеют никакой связи с настоящим временем. Оно помогает описать действия или события, которые произошли в определенный момент в прошлом. Правильное использование Past Simple является важным элементом в освоении английского языка и позволяет грамотно рассказывать о прошлых событиях."
t14 =   "Правило <i>Future Simple</i> (простое будущее время) в английском языке используется для выражения действий или событий, которые произойдут в будущем. В Future Simple для всех лиц (I, you, he/she/it, we, they) используется вспомогательное слово <i>will</i> перед основной формой глагола, чтобы обозначить будущее время.\n\n" \
        "Давайте рассмотрим это правило в различных формах:\n\n" \
        "1)Positive form (утвердительная форма):\n\n" \
        "I will go to the beach tomorrow. (Я пойду на пляж завтра.)\n" \
        "She will study for her exam. (Она будет готовиться к экзамену.)\n" \
        "We will visit our grandparents next week. (Мы поедем навестить своих бабушку и дедушку на следующей неделе.)\n" \
        "They will play football on Saturday. (Они будут играть в футбол в субботу.)\n\n" \
        "2)Negative form (отрицательная форма):\n\n" \
        "I will not go to the beach tomorrow. (Я не пойду на пляж завтра.)\n" \
        "She will not study for her exam. (Она не будет готовиться к экзамену.)\n" \
        "We will not visit our grandparents next week. (Мы не поедем навестить своих бабушку и дедушку на следующей неделе.)\n" \
        "They will not play football on Saturday. (Они не будут играть в футбол в субботу.)\n\n" \
        "3)Question form (вопросительная форма):\n\n" \
        "Will you go to the beach tomorrow? (Ты пойдешь на пляж завтра?)\n" \
        "Will she study for her exam? (Она будет готовиться к экзамену?)\n" \
        "Will we visit our grandparents next week? (Мы поедем навестить своих бабушку и дедушку на следующей неделе?)\n" \
        "Will they play football on Saturday? (Они будут играть в футбол в субботу?)\n\n" \
        "<i>Future Simple</i> используется для выражения планов, предсказаний или решений, которые будут совершены в будущем. Это одно из основных будущих времен в английском языке, и его правильное использование позволяет говорить о будущих событиях и действиях с уверенностью."
t15 =   "Правило <i>Present Continuous</i> (настоящее продолженное время) в английском языке используется для описания действий, которые происходят в момент речи или вокруг нее, а также для выражения временных действий, происходящих в настоящее время. Для образования Present Continuous используется вспомогательный глагол <i>to be</i> в настоящем времени (am, is, are), а к основному глаголу добавляется окончание <i>-ing</i>.\n\n" \
        "Давайте рассмотрим это правило в различных формах:\n\n" \
        "1)Positive form (утвердительная форма):\n\n" \
        "I am reading a book. (Я читаю книгу.)\n" \
        "She is watching a movie. (Она смотрит фильм.)\n" \
        "We are playing football. (Мы играем в футбол.)\n" \
        "They are studying for their exams. (Они готовятся к экзаменам.)\n" \
        "2)Negative form (отрицательная форма):\n\n" \
        "I am not reading a book. (Я не читаю книгу.)\n" \
        "She is not watching a movie. (Она не смотрит фильм.)\n" \
        "We are not playing football. (Мы не играем в футбол.)\n" \
        "They are not studying for their exams. (Они не готовятся к экзаменам.)\n\n" \
        "3)Question form (вопросительная форма):\n\n" \
        "Are you reading a book? (Ты читаешь книгу?)\n" \
        "Is she watching a movie? (Она смотрит фильм?)\n" \
        "Are we playing football? (Мы играем в футбол?)\n" \
        "Are they studying for their exams? (Они готовятся к экзаменам?)\n\n" \
        "<i>Present Continuous</i> используется для выражения действий, которые происходят в текущий момент речи, а также для временных действий, которые происходят вокруг нас в настоящее время. Оно позволяет описывать текущие события и действия с определенностью и уточнением."
WAIT_ANSWER = "🔔Ваше сообщение отправилось админу.\n\n" \
              "Ожидайте ответа⏳"
DESCRIPTION_PROBLEMS = "🧐Опишите подробно собственную проблему:"
QUESTION_USER = "Вопрос от пользователя: {}\n" \
              "ID пользователя: {}\n" \
              "Ссылка на пользователя: {}\n" \
              "Алиас пользователя: @{}"
WARNING_IF_NOT_TEXT = "Вводите только текст.\n\n" \
                      "<i>Напишите /support для повторного обращения в техподдержку.</i>"
WARNING_IF_SEND_COMMANDS = "⚠️Данное сообщение является командой бота, поэтому оно не отправится админу.\n\n" \
                           "<i>Напишите /support для повторного обращения в техподдержку.</i>"
CAME_ANSWER = "<b>{}, пришел ответ!</b>\n" \
              "📝Ответ на ваш вопрос: {}\n" \
              "👨‍💻Ответил: @{}"
SUCCESS_SEND_MESSAGE_TO_USER = "Вы успешно отправили сообщение пользователю {}\n" \
                               "Имя пользователя: @{}\n"
NONE_COMMANDS = "🆘Такой команды не существует.\n\n"